Repository: Sreys10/ngo_app2
Catalog: ngo_app/lib/FINANCE1/compo2/app_*.arb
Languages: mr

# appTitle
source: BudgetWise
mr: बजेटवाइज

# welcomeText
source: Welcome to BudgetWise!
mr: बजेटवाइजमध्ये आपले स्वागत आहे!

# descriptionText
source: Master the art of budgeting and make smart financial decisions.
mr: बजेटच्या कलेत प्राविण्य मिळवा आणि स्मार्ट आर्थिक निर्णय घ्या.

# startChallenge
source: Start the Challenge
mr: आव्हान सुरू करा

# timer
source: Timer: {remainingTime}
mr: टाइमर: {remainingTime}

source: Submit Budget
mr: बजेट सादर करा

# remainingBudgetLabel
source: Remaining Budget: ₹{remainingBudget}
mr: उर्वरित बजेट: ₹{remainingBudget}

# invalidAllocation
source: Invalid allocation! Budget exceeded or negative input.
mr: अवैध वाटप! बजेट ओलांडले किंवा नकारात्मक इनपुट.

# budgetExceeded
source: Budget cannot exceed total budget.
mr: बजेट एकूण बजेटपेक्षा जास्त नसावे.

# wellDone
source: Well Done! Coins Earned: {coins}
mr: उत्तम! नाणी कमावली: {coins}

source: Achievement Unlocked!
mr: उपलब्धी अनलॉक झाली!

source: Keep Improving!
mr: सुधारत राहा!

source: Level Up!
mr: लेव्हल अप!

source: Money Master!
mr: मनी मास्टर!

source: Budgeting Guru!
mr: बजेटिंग गुरु!

source: OK
mr: ठीक आहे

source: Time's Up!
mr: वेळ संपली!

# timeExceeded
source: You have exceeded the time limit for this scenario.
mr: तुम्ही या परिदृश्याची वेळ मर्यादा ओलांडली आहे.

# cn
source: Continue
mr: सुरू ठेवा

source: Exit
mr: बाहेर पडा

source: Scenario Details
mr: परिदृश्य तपशील

source: Suggested Budget:
mr: सुचविलेले बजेट:

source: Results
mr: निकाल

# totalSpent
source: Total Spent: ₹{allocatedBudget}
mr: एकूण खर्च: ₹{allocatedBudget}

# feedbackExcellent
source: 🎉 Excellent! Great job!
mr: 🎉 उत्कृष्ट! उत्तम काम!

# feedbackGood
source: 😊 Good effort! Keep improving!
mr: 😊 चांगला प्रयत्न! सुधारणा करत राहा!

# feedbackTryBetter
source: 😟 Try better next time!
mr: 😟 पुढच्या वेळी चांगला प्रयत्न करा!

source: Next Scenario
mr: पुढील परिदृश्य

source: Congratulations
mr: अभिनंदन

# completionMessage
source: You have completed all scenarios!🎉
mr: तुम्ही सर्व परिदृश्य पूर्ण केले आहेत!🎉

# totalScore
source: Total Score: {score}
mr: एकूण गुण: {score}

# totalCoins
source: Total Coins: {coins}
mr: एकूण नाणी: {coins}

# scenarioTitleLabel
source: Scenario: {scenarioTitle}
mr: परिदृश्य: {scenarioTitle}

# scenarioTitleLabel1
source: Scenario:
mr: परिदृश्य:

# restartGame
source: Restart the Game
mr: खेळ पुन्हा सुरू करा

# scenarioTitle1
source: Summer Job Earnings
mr: उन्हाळ्यातील नोकरीतून कमाई

# scenarioDescription1
source: You earned ₹2000 from your summer job. Plan your budget for the month.
mr: तुम्ही तुमच्या उन्हाळ्यातील नोकरीतून ₹2000 कमावले. महिन्याचे बजेट बनवा.

# scenarioTitle2
source: Weekend Trip
mr: वीकेंड ट्रिप

# scenarioDescription2
source: You want to go on a weekend trip with friends. Allocate your budget accordingly.
mr: तुम्हाला मित्रांसोबत वीकेंड ट्रिपवर जावंय. तुमचं बजेट तुमच्या बजेटनुसार वाटप करा.

# scenarioTitle3
source: New Phone Savings
mr: नवीन फोन बचत

# scenarioDescription3
source: You're saving up for a new phone worth ₹5000. How much can you save this month?
mr: तुम्ही ₹5000 किंमतीचा नवीन फोन घेण्यासाठी बचत करत आहात. या महिन्यात तुम्ही किती बचत करू शकता?

# scenarioTitle4
source: Birthday Gift
mr: वाढदिवसाचा भेटवस्तु

# scenarioDescription4
source: You have ₹2000 to buy a gift for your friend's birthday.
mr: तुमच्याकडे तुमच्या मित्राच्या वाढदिवसासाठी ₹2000 आहेत.

# scenarioTitle5
source: School Supplies
mr: शालेय साहित्य

# scenarioDescription5
source: You need to buy school supplies with ₹2500. Plan your purchases.
mr: तुम्हाला ₹2500 मध्ये शालेय साहित्य विकत घ्यायचं आहे. तुमच्या खरेदीची योजना तयार करा.

# scenarioTitle6
source: Concert Tickets
mr: संगीत मैफिलीचे तिकीट

# scenarioDescription6
source: You want to buy concert tickets worth ₹1800. Plan your savings for this month.
mr: तुम्हाला ₹1800 किंमतीचे संगीत मैफिलीचे तिकीट घ्यायचे आहे. या महिन्यात तुमची बचत कशी नियोजित करावी.

# scenarioBudgetMismatch
source: Scenario {scenarioTitle} has a mismatched budget! Calculated total: ₹{totalBudget}
mr: परिदृश्य {scenarioTitle} चा अर्थसंकल्प जुळत नाही! मोजलेली एकूण रक्कम: ₹{totalBudget}

# errorTitle
source: Budget Mismatch Error
mr: अर्थसंकल्प जुळत नाही त्रुटी

# okButton
source: OK
mr: ठीक आहे

source: Groceries
mr: किराणा सामान

source: Transportation
mr: वाहतूक

source: Entertainment
mr: मनोरंजन

source: Savings
mr: बचत

source: Personal Care
mr: वैयक्तिक काळजी

source: Books
mr: पुस्तके

source: Stationery
mr: स्टेशनरी

source: Gift
mr: भेट

source: Snacks
mr: स्नॅक्स

source: Food
mr: अन्न

source: Backpack
mr: पाठ्यपुस्तक

source: Sports
mr: खेळ

source: Headphones
mr: हेडफोन

source: Mouse
mr: माउस

source: Course Fee
mr: अभ्यासक्रम शुल्क

source: Study Materials
mr: अभ्यास साहित्य

source: Party Contribution
mr: पार्टी योगदान
